gauthig/firefly-touch/proxy/sdkconfig.defaults
# Classic ESP32 (ESP32-D0WD-V3, 4 MB flash, no PSRAM) — the basement BLE
# proxy. Deliberately NOT the panels' ESP32-S3 config: no PSRAM, no RGB LCD,
# no TWAI, and BLE 4.2 rather than 5.0.
CONFIG_IDF_TARGET="esp32"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# Custom single-factory table: the IDF default gives the app 1 MB and a
# Bluedroid + WiFi build is just over that. See proxy/partitions.csv.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# Bluetooth: BLE only. Releasing the Classic BT controller memory is worth
# real RAM on this chip, which (unlike the S3) has a full BR/EDR radio.
CONFIG_BT_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=y
CONFIG_BTDM_CTRL_MODE_BLE_ONLY=y
CONFIG_BTDM_CTRL_MODE_BR_EDR_ONLY=n
CONFIG_BTDM_CTRL_MODE_BTDM=n

# GATT client only — this node never advertises or acts as a peripheral.
CONFIG_BT_GATTC_ENABLE=y
CONFIG_BT_GATTS_ENABLE=n

# Five BLE links now: three battery packs, the Power Watchdog, and the
# Renogy MPPT controller. Six rather than five so a reconnect that briefly
# overlaps a still-open link has somewhere to go — sitting exactly on the
# limit means the overlap fails instead.
#
# ⚠️ TWO SEPARATE LIMITS, and only the second one is actually enforced by
# the radio. BT_ACL_CONNECTIONS is Bluedroid's HOST-side table;
# BTDM_CTRL_BLE_MAX_CONN is the CONTROLLER's, and it defaults to 3.
# Raising only the host one changes nothing: the controller refuses the 4th
# link with HCI status 0x09 "Conn Limit Exceeded", which surfaces as
# `open failed, status 133` on whichever client lost the race — a plausible
# per-device fault rather than anything pointing at a global cap.
#
# Worse, the losing client then retries forever, and every retry issues an
# LE_Create_Connection that makes LE_Set_Scan_Enable return "Cmd Disallowed"
# — so a client still trying to DISCOVER its device gets starved too. That
# is exactly how it presented at the coach: battery 3 and the solar
# controller both dark, for one reason that looked like two.
#
# Keep these two in step.
CONFIG_BT_ACL_CONNECTIONS=6
CONFIG_BTDM_CTRL_BLE_MAX_CONN=6

CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_COMPILER_OPTIMIZATION_PERF=y
